export const descriptions = {
    course1: 
        `----------------------------------------\n課程名稱：讓電玩變好玩的魔法,
        課程介紹：
        不知道各位平常玩不玩遊戲、看不看電競直播？
        各位是否曾思考過，電玩作為軟體，背後藏著什麼秘密——
        - 為什麼跑 3D 遊戲好卡，怎麼樣才不會卡？
        - 為什麼在開放世界，遠處的景物都會變糊變醜？
        - 傳說中的光線追蹤是什麼？為什麼需要那麼貴的顯示卡？
        除此之外，還會帶大家分析經典遊戲與程式背後隱含的資工知識！

        課程名稱：探索電腦的內在，解密核心零件的力量
        課程介紹：
        你每天用電腦，但你真的了解它嗎？
        只知道螢幕畫面裡的軟體程式，但你真實摸的到的硬體，卻連看都沒看過？
        這堂課帶你認識電腦裡的各種零件，
        不只是空口說說，直接拆一台電腦給你看，讓你看清他們的廬山真面目。

        課程名稱：Boom！成為爆破專家的 Day [0]
        課程介紹：
        「月考怎麼只考 99 分！家裡 Wi-Fi 我改密碼了！沒考 100 分你就別想上網！」
        小明的網路自由，被媽媽的 Wi-Fi 密碼封印！
        於是，他開始了瘋狂的手動輸入密碼測試：「mama520...不對，12345678...還是不對！」
        此時，隔壁老王，手拿筆電，悠悠地出現在門口，露出神秘微笑：
        「還在一個個手打？不累嗎？密碼是拿來爆破的，不是拿來猜的！」
        本課堂你將學到:
        - 弱密碼的危害
        - 離線爆破Wi-Fi
        - 爆破工具比較 
        原神可莉曾經說過:「蹦蹦炸彈 !! 一起來學爆破吧！除了爆破密碼外，要記得陪可莉炸魚喔！」
        `
    ,
    course2: `
        ----------------------------------------\n課程名稱：零與一之中的萬千世界
        課程介紹：
        想知道檔案文件背後的儲存方式嗎？
        想知道壓縮軟體是怎麼讓檔案變小的嗎？
        又或者是想一窺在資工發展的上古時期，任天堂工程師們是如何壓榨遊戲機資源？
        那麼，快來選這堂《數位檔案編碼》吧！
        在這堂課裡，我們首先會介紹數位檔案的基本形式，釐清資料的本質，並分析平時最常見的檔案格式—點陣圖；接著，我們會讓各位理解資料壓縮的基礎知識、特性以及限制；最後，再用一段歷史闡述編碼與壓縮技術的利用能帶來何種力量。

        課程名稱：揭開你每天上網的秘密
        課程介紹：
        你有沒有想過，每天輸入網址，按下 Enter，然後畫面就出來了——這背後到底發生了什麼？我們將帶你一步步揭開網頁誕生的過程，從你敲下網址的那一刻，到資料從遠方傳來，再到文字、樣式和互動出現在螢幕上。
        這堂課還會特別探索瀏覽器這個神奇工具。你可能覺得瀏覽器沒什麼好玩，但其實是你還沒發現它的潛力！它藏著超強的隱藏功能，讓你不用寫複雜程式，就能創造自己的網頁，甚至把任何網頁改成你喜歡的樣子！

        課程名稱：從 0 開始的密碼學生活
        課程介紹：
        「ㄟ小明，你知道有遊戲把商標藏在鳥的叫聲中嘛 ?!」
        「蝦？鳥的叫聲是要怎麼藏商標？不會又是米哈遊吧？」
        「你猜得好準哦 !! 就是原神的鳥叫聲藏了 MiHoYo，他是用摩斯密碼藏的！但你知道嗎？這種『把訊息藏起來』的技術，從幾百年前就開始了！」
        密碼學，不只是駭客、間諜在用，其實它早就滲透在我們的遊戲、歷史、戰爭和生活中！
        這堂課，會帶你踏入密碼學的殿堂，讓你對各類加密有基礎的認識，並透過 CTF 題目來幫助你穩固知識
        本課程你將學到：
        古典密碼學
        現代密碼學
        CTF
        甚麼？你怕這堂課太複雜 ?! NoNoNo~ 這堂課會帶你認識基礎概念，不會深究加密原理，對新手超級友善。
    `
    // Add more course descriptions as needed

}