export const FLAG_COLOR_white = '#ffffff';
export const FLAG_COLOR_gray = '#2C2C2C'; // 集中管理 flag 顏色

export const schedules_morning = [
    {
        name: '邊緣人的好朋友 —— 在 Discord 跟 AI 機器人聊天吧！',
        description:
            '相信大家都有在 Discord 跟朋友聊天的經驗吧～\n什麼！你說沒有朋友跟你聊天，幫你 QQ😢\n但是沒關係，在這堂課你可以學會怎麼寫你的第一隻 Discord bot。\n甚至可以透過串接生成式 AI，\n幫你的機器人注入靈魂，\n這樣你就有一個跟你聊天的機器人了～\n再也不需要找朋友聊天了。\n本堂課程你將學到：\n✅教你寫出第一隻 Discord bot\n✅講解生成式 AI\n✅講解 API 的原理\n✅教你如何使用 Gemini API，並串接 Discord bot，在 Discord 製作 AI 聊天機器人',
        class: 'row-span-3',
        showmodal: false
    },
    {
        name: '如何打造自己的遊戲 —— Discord Bot 的進階語法',
        description:
            '經過雜貨店，不經意的一撇，竟然是大搖 🕹️\n來玩玩看吧，腦海不自覺地浮現這個想法。\n拉張塑膠椅，扭了扭頭，轉了轉手...\n一切，準備就緒！\n「鏘！」十元投下去...\n手指飛快的在按鍵之間飛梭。\n「丟丟丟丟...拐拐...」\n馬上來打臉我的，是大大的「GAMEOVER」字樣 👾\n對，我只是在亂按 🙃\n可惡...這也太難了...\n遊戲機...氣人...\n如果你也覺得遊戲機氣人的話😡\n不妨試試做自己的遊戲機器人🤖\n這堂課，你會學到：\n✅ 考驗即時反應的 QTE 事件\n✅ 模擬 RPG 的對話系統\n✅ 類似寶可夢的回合對戰\n❎ 好討厭的感覺呀~~~\n此外，此外，本堂課將接合前面所學\n利用 AI 幫你生成屬於自己的世界觀 🏞️\n我們將一步步手把手教學，帶你從不會學到會。\n因為：\n「雖然只是遊戲，但可不是鬧著玩的。」 ',
        class: 'row-span-3',
        showmodal: false
    },
    {
        name: '黑客松',
        description: '💻黑客松專案開發時間，加緊趕工啊啊啊～',
        class: 'row-span-3',
        showmodal: false
    },
    {
        name: '報到 + 破冰',
        description: '🧊歡迎來到「資遊你和我的師界」！這個環節我們將進行破冰活動，讓組內夥伴互相認識，為四天的活動拉開序幕～\n',
        class: 'row-span-1',
        showmodal: false,
        flag: {
            text: 'flag{||4c435d3171760edf7bf41a907eedc0||}',
            color: FLAG_COLOR_gray
        }
    },
    {
        name: '開幕 +《走進 CS》講座',
        description: '🚩營隊開幕式\n介紹課程、活動與生活規範。\n\n💻《走進 CS》講座\n本場講座邀請臺師大資工系系主任葉梅珍教授，引領高中生學員們一起來了解資工系的世界，以及資工系學生的生活與學習！這堂課不僅是一場講座，更是一次與未來的對話！讓我們一起探索資工的奧秘吧！',
        class: 'row-span-1',
        showmodal: false
    }
];

export const schedules_afternoon = [
    {
        name: 'Python 基礎',
        description:
            '你是不是常常聽到「Python 很簡單，適合初學者」但打開程式編輯器還是覺得好陌生？\n別擔心！這堂課就是為了你這樣的 零經驗新手 設計的 🚀\n從最基本的輸出、變數、計算開始，\n再一路帶你搞懂「什麼是 if 判斷？for 跑來跑去要跑去哪？」\n學完之後，你就能：\n✔️ 寫出自己的小工具\n✔️ 跑迴圈跑得比小明還快\n✔️ 和別人說「我會 Python 喔！」\n我們還會透過實際的 小練習 & 有趣範例，讓你不只是會看，也真的寫得出來～\n別擔心看不懂、不敢問，這堂課就是你的 程式啟蒙起點！',
        class: 'row-span-2',
        showmodal: false
    },
    {
        name: '選修課一',
        description: `🎮課程名稱：讓電玩變好玩的魔法
        課程介紹：
        不知道各位平常玩不玩遊戲、看不看電競直播？
        各位是否曾思考過，電玩作為軟體，背後藏著什麼秘密——
        ❓為什麼跑 3D 遊戲好卡，怎麼樣才不會卡？
        ❓為什麼在開放世界，遠處的景物都會變糊變醜？
        ❓傳說中的光線追蹤是什麼？為什麼需要那麼貴的顯示卡？
        除此之外，還會帶大家分析經典遊戲與程式背後隱含的資工知識！

        ⚙️課程名稱：探索電腦的內在，編織資訊的橋樑
        課程介紹：
        你每天都在用電腦，打報告、玩遊戲、看影片，
        但你有沒有想過電腦裡面到底長什麼樣子？
        
        在這堂課，我們不只是「講解」電腦硬體，
        而是要直接打開一台真的電腦，
        帶你從零件的外觀開始，一步一步了解它們的功能與運作原理。
        
        但我們不只要看「裡面」，還要連到「外面」。
        
        你知道電腦怎麼連上網路的嗎？
        除了無線 Wi-Fi，其實一條細細的線，就能將電腦與世界連結。
        這堂課，我們要帶你親手製作一條可以真的使用的網路線！
        
        🔐課程名稱：從 0 開始的密碼學生活
        課程介紹：
        「ㄟ小明，你知道有遊戲把商標藏在鳥的叫聲中嘛 ?!」
        「蝦？鳥的叫聲是要怎麼藏商標？不會又是米哈遊吧？」
        「你猜得好準哦 !! 就是原神的鳥叫聲藏了 MiHoYo，他是用摩斯密碼藏的！但你知道嗎？這種『把訊息藏起來』的技術，從幾百年前就開始了！」
        密碼學，不只是駭客、間諜在用，其實它早就滲透在我們的遊戲、歷史、戰爭和生活中！
        這堂課，會帶你踏入密碼學的殿堂，讓你對各類加密有基礎的認識，並透過 CTF 題目來幫助你穩固知識
        本課程你將學到：
        ✅古典密碼學
        ✅現代密碼學
        ✅CTF
        甚麼？你怕這堂課太複雜 ?! NoNoNo~ 這堂課會帶你認識基礎概念，不會深究加密原理，對新手超級友善。
        `,
        class: '',
        showmodal: false
    },
    {
        name: '選修課二',
        description: ` \
        🗂️課程名稱：零與一之中的萬千世界
        課程介紹：
        想知道檔案文件背後的儲存方式嗎？
        想知道壓縮軟體是怎麼讓檔案變小的嗎？
        又或者是想一窺在資工發展的上古時期，任天堂工程師們是如何壓榨遊戲機資源？
        那麼，快來選這堂《數位檔案編碼》吧！
        在這堂課裡，我們首先會介紹數位檔案的基本形式，釐清資料的本質，並分析平時最常見的檔案格式—點陣圖；接著，我們會讓各位理解資料壓縮的基礎知識、特性以及限制；最後，再用一段歷史闡述編碼與壓縮技術的利用能帶來何種力量。
        
        ☁️課程名稱：The Mirror in Your Words. 雲端 AI 玩轉個人化分析。
        課程介紹：
        我們每天都在 LINE、IG、Threads 上留下文字的足跡。但你有想過，這些文字可以讓 AI 看出你的個性與喜好嗎？這堂課將從生活中最熟悉的文字出發，一步步實作出文字資料視覺化，並且使用雲端運算以 AI 分析出獨一無二的 MBTI 報告。帶你從想法到實際操作，玩出「屬於你」的成果。
        本課程你將學到：
        ✅認識雲端運算
        ✅在雲端運算平台部署服務
        ✅個人化文字資料視覺化
        ✅使用 AI 打造你專屬的分析報告

        🧱課程名稱：Boom！成為爆破專家的 Day [0]
        課程介紹：
        「月考怎麼只考 99 分！家裡 Wi-Fi 我改密碼了！沒考 100 分你就別想上網！」
        小明的網路自由，被媽媽的 Wi-Fi 密碼封印！
        於是，他開始了瘋狂的手動輸入密碼測試：「mama520...不對，12345678...還是不對！」
        此時，隔壁老王，手拿筆電，悠悠地出現在門口，露出神秘微笑：
        「還在一個個手打？不累嗎？密碼是拿來爆破的，不是拿來猜的！」
        本課堂你將學到:
        ✅弱密碼的危害
        ✅離線爆破 Wi-Fi
        ✅真實事件模擬
        原神可莉曾經說過:「蹦蹦炸彈 !! 一起來學爆破吧！除了爆破密碼外，要記得陪可莉炸魚喔！」
        `,
        class: '',
        showmodal: false
    },
    {
        name: '黑客松報告',
        description: "🫵It's your time!\n各組展示黑客松專案成果，並由講師們提供回饋。🎤",
        class: '',
        showmodal: false
    },
    {
        name: '擁有自己的男女朋友 —— Discord bot AI 生圖',
        description:
            '「ㄟㄟ，聽說每月的 14 號都是情人節欸。1 月是日記情人節，2 月是西洋情人節，3 月是白色情人節......」「夠了，別說了。嗚嗚嗚......」\n每月的情人節都是自己過或是情人節想增加一些樂趣嗎？Discord bot 來幫忙 !!!\n本堂課你將學到：\n✅在 Discord 中，利用 Discord bot 傳送圖片\n✅將 Discord bot 搭配 AI，使其能夠在 Discord 中生圖\n✅網頁框架 Flask\n✅內網穿透 ngrok\n✅diffuser（圖片生成式 AI）',
        class: 'text-base',
        showmodal: false,
        flag: {
            text: 'flag{||fc7e051acf235ba4aa783647469e67||}',
            color: FLAG_COLOR_white
        }
    },
    {
        name: '黑客松',
        description: '💡黑客松專案開發時間。',
        class: '',
        showmodal: false
    },
    {
        name: '閉幕',
        description: '課程總結、結業式與合影，為這場學習之旅畫上完美的句點。🎉',
        class: '',
        showmodal: false
    }
];

export const schedules_night = [
    {
        name: '敬請期待',
        description: '未知的旅途等你來探索！🤩',
        class: 'row-span-2',
        showmodal: false
    },
    {
        name: '敬請期待',
        description: '想知道？那就報名參加！🥳',
        class: 'row-span-2',
        showmodal: false
    },
    {
        name: '敬請期待',
        description: '沒錯，敬請期待！🥰',
        class: 'row-span-2',
        showmodal: false
    },
    
];
